#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
/infra/instances/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/actions-hero/actions-hero/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/actions-hero/actions-hero

To view this run in a browser, visit:
https://app.terraform.io/app/metaroon/staging/runs/run-vNhr9XXEumDuZXnK

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...
google_compute_project_metadata.ssh_keys: Refreshing state... [id=academic-matter-404418]
google_dns_managed_zone.my_zone: Refreshing state... [id=projects/academic-matter-404418/managedZones/my-managed-zone]
google_compute_instance.staging_cicd_demo: Refreshing state... [id=projects/academic-matter-404418/zones/us-central1-a/instances/staging-cicd-demo]
google_dns_record_set.my_instance_dns: Refreshing state... [id=projects/academic-matter-404418/managedZones/my-managed-zone/rrsets/staging-cicd.wisdomdemo.com./A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_dns_record_set.my_instance_dns has been deleted
  - resource "google_dns_record_set" "my_instance_dns" {
        id           = "projects/academic-matter-404418/managedZones/my-managed-zone/rrsets/staging-cicd.wisdomdemo.com./A"
      - name         = "staging-cicd.wisdomdemo.com." -> null
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.staging_pr_demo will be created
  + resource "google_compute_instance" "staging_pr_demo" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "f1-micro"
      + metadata             = {
          + "ssh-keys"       = "terraform:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCyhIxC0QmWB8ZK/6iDXRYgSO+o/5WJvIzwKAJm35RETf5mb/KUOminmGpILuRFnhQ1IDMHBzJUrnZMTo9UVdDLv2LaesEIVJtccJ3NTUAv4K3Kd4td94YZYY29GXHM07g9Ev0PZQWZfSPn36GB9/8fMq1XbRjS5DXGS6TeRokIrmYoraOq0FLkCXKjjlJk+UcPaFHz8x4MdlODCsrzfCVZuAR7AhvQasQmvuddypEuvmDKBwJdxtfLvHKiW9QDI/rVLX0hVgS05sg09Yo3nGM7wpgzoH4dJGaz48LnbOxOiqlFJIzxFouhnQpbTJYCthJerUJI8lRHp1n1cx7Bsb/9 stoxmod"
          + "startup-script" = <<-EOT
                #!/bin/bash
                set -e
                
                # Install dependencies
                sudo DEBIAN_FRONTEND=noninteractive apt-get -y -o Dpkg::Options::="--force-confdef" -o Dpkg::Options::="--force-confold" dist-upgrade
                sudo DEBIAN_FRONTEND=noninteractive apt-get -y -qq update
                sudo DEBIAN_FRONTEND=noninteractive apt-get -y -qq install curl wget git vim apt-transport-https ca-certificates nginx
                
                # Setup NodeJS 16.x
                curl -sL https://deb.nodesource.com/setup_16.x | sudo -E bash -
                sudo DEBIAN_FRONTEND=noninteractive apt-get -y -qq install nodejs
                sudo npm install pm2@latest -g
                
                # Setup sudo to allow no-password sudo for "metaroon" group and adding "stoxmod" user
                sudo groupadd -r metaroon
                sudo useradd -m -s /bin/bash stoxmod
                sudo usermod -a -G metaroon stoxmod
                sudo cp /etc/sudoers /etc/sudoers.orig
                echo "stoxmod ALL=(ALL) NOPASSWD:ALL" | sudo tee /etc/sudoers.d/stoxmod
                
                # Change deployment directory path and permissions
                sudo mkdir -p /var/app
                sudo chown -R stoxmod:stoxmod /var/app
                
                # Setup nginx
                # Remove the default configuration
                sudo sh -c '> /etc/nginx/sites-available/default' && \
                sudo sh -c 'sudo cat <<EOF > /etc/nginx/sites-available/default
                upstream app_upstream {
                server 127.0.0.1:5000;
                keepalive 64;
                }
                
                server {
                listen 80 default_server;
                listen [::]:80 default_server;
                server_name _;
                
                location / {
                proxy_set_header X-Forwarded-For \$proxy_add_x_forwarded_for;
                proxy_set_header X-Real-IP \$remote_addr;
                proxy_set_header Host \$http_host;
                
                proxy_http_version 1.1;
                proxy_set_header Upgrade \$http_upgrade;
                proxy_set_header Connection "upgrade";
                
                proxy_pass http://localhost:5000;
                proxy_redirect off;
                proxy_read_timeout 240s;
                }
                }
                EOF'
            EOT
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = (known after apply)
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "staging-pr-demo",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "projects/debian-cloud/global/images/family/debian-10"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
    }

  # google_compute_project_metadata.ssh_keys will be updated in-place
  ~ resource "google_compute_project_metadata" "ssh_keys" {
        id       = "academic-matter-404418"
      ~ metadata = {
          ~ "ssh-keys" = "terraform:ssh-rsa ..........redacted........+q4MTsVqkAXcz6UWWayKIc1PWJVBk8QtvCcQ== ubuntu@staging" -> "terraform:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCyhIxC0QmWB8ZK/6iDXRYgSO+o/5WJvIzwKAJm35RETf5mb/KUOminmGpILuRFnhQ1IDMHBzJUrnZMTo9UVdDLv2LaesEIVJtccJ3NTUAv4K3Kd4td94YZYY29GXHM07g9Ev0PZQWZfSPn36GB9/8fMq1XbRjS5DXGS6TeRokIrmYoraOq0FLkCXKjjlJk+UcPaFHz8x4MdlODCsrzfCVZuAR7AhvQasQmvuddypEuvmDKBwJdxtfLvHKiW9QDI/rVLX0hVgS05sg09Yo3nGM7wpgzoH4dJGaz48LnbOxOiqlFJIzxFouhnQpbTJYCthJerUJI8lRHp1n1cx7Bsb/9 stoxmod"
        }
        # (1 unchanged attribute hidden)
    }

  # google_dns_managed_zone.my_zone must be replaced
-/+ resource "google_dns_managed_zone" "my_zone" {
      ~ id            = "projects/academic-matter-404418/managedZones/my-managed-zone" -> (known after apply)
      - labels        = {} -> null
      ~ name          = "my-managed-zone" -> "pr-staging-zone" # forces replacement
      ~ name_servers  = [
          - "ns-cloud-e1.googledomains.com.",
          - "ns-cloud-e2.googledomains.com.",
          - "ns-cloud-e3.googledomains.com.",
          - "ns-cloud-e4.googledomains.com.",
        ] -> (known after apply)
      ~ project       = "academic-matter-404418" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # google_dns_record_set.my_instance_dns will be created
  + resource "google_dns_record_set" "my_instance_dns" {
      + id           = (known after apply)
      + managed_zone = "pr-staging-zone"
      + name         = (known after apply)
      + project      = (known after apply)
      + rrdatas      = [
          + (known after apply),
        ]
      + ttl          = 300
      + type         = "A"
    }

  # random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 4 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ instance_dns_name = "staging-cicd.wisdomdemo.com." -> (known after apply)
╷
│ Warning: Version constraints inside provider configuration blocks are deprecated
│ 
│   on provider.tf line 10, in provider "random":
│   10:     version = "~> 2.2"
│ 
│ Terraform 0.13 and earlier allowed provider version constraints inside the
│ provider configuration block, but that is now deprecated and will be
│ removed in a future version of Terraform. To silence this warning, move the
│ provider version constraint into the required_providers block.
╵

```

</details>

*Pusher: @stoXmod, Action: `workflow_dispatch`*